       *> My First COBOL PROGRAM
       >>SOURCE FORMAT FREE
IDENTIFICATION DIVISION.
PROGRAM-ID. LEARNING.
AUTHOR. AL. 
DATE-WRITTEN. APRIL 21ST 2021
ENVIRONMENT DIVISION.

DATA DIVISION.
FILE SECTION.
WORKING-STORAGE SECTION.
*> variable is here

PROCEDURE DIVISION.
*> code is here

STOP RUN.
