       *> My First COBOL PROGRAM
       >>SOURCE FORMAT FREE
IDENTIFICATION DIVISION.
PROGRAM-ID. LEARNING.
AUTHOR. AL. 
DATE-WRITTEN. APRIL 21ST 2021
ENVIRONMENT DIVISION.

DATA DIVISION.
FILE SECTION.
WORKING-STORAGE SECTION.

01 Num1 PIC 9 VALUE 5.
01 Num2 PIC 9 VALUE 4.
01 Num3 PIC 9 VALUE 3.
01 Ans PIC S99V99 VALUE 0.
01 Rem PIC 9V99.

PROCEDURE DIVISION.

COMPUTE Ans = Num1 + Num2
COMPUTE Ans = Num1 - Num2
COMPUTE Ans = Num1 * Num2
COMPUTE Ans = Num1 / Num2
COMPUTE Ans = Num1 ** Num2
COMPUTE Ans = (5 + 4) * 5
COMPUTE Ans ROUNDED = 3.0 + 2.005
DISPLAY Ans

STOP RUN.
